# BuiltInFailures.MassFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures Class
BuiltInFailures Class Members See Also
---
Failures about Mass.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MassFailures
```

Visual Basic
---
```text
Public NotInheritable Class MassFailures
```

Visual C++
---
```text
public ref class MassFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MassFailures
# See Also
BuiltInFailures..::..MassFailures Members
Autodesk.Revit.DB Namespace